Tekla.Structures.ClashCheckOptions
The ClashCheckOptions class represents the clash check options.

Tekla.Structures.ClashCheckOptions.BoltHeadDiameter
The bolt head diameter.

Tekla.Structures.ClashCheckOptions.NutThickness
The nut thickness.